Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F19A.tmx
Source language: en_us
Languages: zh_cn

source: 10 Adorable Characteristics Happy People Have
zh_cn: 快乐的人拥有的10大令人羡慕的性格

source: Everybody wants to be happy, but how many people can say they are?
zh_cn: 每个人都希望自己快乐。但是有多少人敢说他们是快乐的呢？

source: A recent study shows that only one out of every three Americans is actually happy.
zh_cn: 最近的一份研究显示只有1/3的美国人是快乐的。

source: On a list of the top 20 happiest countries in the world, America just barely ranks at #17.
zh_cn: 在一份显示世界上最快乐的20个国家的名单中，美国排在第17位。

source: This is kind of ridiculous when you think about all the freedoms and conveniences Americans enjoy that less wealthy nations will never experience.
zh_cn: 当你想到美国人民享受其他不太富裕国家的人们享受不了的自由和方便时，看到这个排名你会觉得很可笑。

source: Even if you are not happy, it is likely you know someone who is.
zh_cn: 即使你自己不快乐，你看上去好像知道谁是快乐的。

source: Think about how much you adore them and why.
zh_cn: 请你想下你是多么的羡慕他们以及羡慕他们的原因。

source: Observe them closely for a while and you might notice a surprising amount of room for growth in your own habits.
zh_cn: 密切的观察这些人一段时间，你会发现你自己的行为习惯有巨大的进步。

source: Here are some of the things happy people do to make life better for everyone around them.
zh_cn: 以下就是快乐的人使他们周围的人生活的更快乐所具有的品质。

source: They Are Nice
zh_cn: 他们很友善

source: It might seem like an overly general term, but happy people are usually nice.
zh_cn: 虽说友善是一个很广泛的词语，但是快乐的人一般都是很友善的。

source: They are well-liked and pleasant to be around.
zh_cn: 他们讨人喜欢。

source: They are respectful, warm, considerate, and helpful.
zh_cn: 他们尊敬人，温暖，考虑周全，乐于助人。

source: They don't get jealous. They don't waste time gossiping and complaining.
zh_cn: 他们不会嫉妒他人，不会八卦，不会抱怨。

source: They seem to have infinite patience and give freely of themselves.
zh_cn: 他们很有耐心，无私奉献。

source: Traits like these can only stem from a deep-seated sense of contentedness.
zh_cn: 只有知足常乐的人才会具有这些性格。

source: Nice people create a social climate that puts everyone else at ease.
zh_cn: 友善的人创造了使周围的人自由舒适的社交环境。

source: They Are Honest
zh_cn: 他们很真诚

source: True happiness cannot coexist with lies.
zh_cn: 真正的快乐是不具有谎言的。

source: Those who lie to themselves are more likely to lie to others and struggle with unhealthy relationships.
zh_cn: 对自己撒谎的人很容易对别人撒谎，这些人也会与不健康的人际关系斗争。

source: Honesty starts with an informed sense of self.
zh_cn: 真诚始于对于自我的真正认识。

source: Happy people know who they are and aren't afraid to show it.
zh_cn: 快乐的人知道他们真正的自己，不畏惧把真我展现出来。

source: They are consistently themselves and do not feel the need to wear masks or pretend to be something they are not for any reason.
zh_cn: 他们始终如一，不会带假面具，也不会为了任何原因假装一些东西。

source: Life is a lot less complicated when you allow yourself to be the same person at all times.
zh_cn: 如果你始终坚持自我，你会发现生活其实是很简单的。

source: By letting go of lies, happy people set an inspiring example which encourages those around them to flourish.
zh_cn: 远离谎言，快乐的人给他们周围的人做了一个鼓舞人心的榜样，他们的行为鼓舞周围的人勇敢的做自己。

source: They Are Cooperative
zh_cn: 他们善于合作

source: Happy people are not overly concerned with dominating, yet they tend to come out on top.
zh_cn: 虽然快乐的人不会过多的思考领导他人，但是他们很容易出类拔萃。

source: Victory is meaningless to the happy person without a team to share in the glory.
zh_cn: 没有团队来分享荣誉，胜利对于快乐的人来说是毫无意义的。

source: There is a reason why it is customary for people who win awards to stand up and give a speech about all the people who helped them along the way.
zh_cn: 这就是人们取得胜利之后，需要站起来，发表演讲，感谢那些帮助过他的人成为传统的原因。

source: It is because nobody gets there alone, and taking all the credit for yourself is just mean.
zh_cn: 因为没有人仅靠自己能够取得成功，把所有的荣誉据为己有是自私的。

source: The idea of winning or dominating denotes pushing other people down on your way to the top.
zh_cn: 为了取得成功或者为了领导他人而牺牲别人的想法是卑鄙的。

source: Those who recognize the efforts of others and freely share the joys of success tend to live much happier lives.
zh_cn: 承认别人的努力，愿意把成功的喜悦分享给他人的人更容易更快乐，拥有更美好的人生。

source: They Have Beautiful Smiles
zh_cn: 他们拥有美丽的笑容

source: There is a huge difference between smiling for the camera and smiling as a function of happiness.
zh_cn: 对着相机展现出来的笑容和因为快乐而显示出来的笑容是十分不同的。

source: Anyone can show their teeth.
zh_cn: 所有人都能微笑。

source: Happy people smile with their entire bodies, and sometimes with all the energy in a one-foot radius.
zh_cn: 快乐的人是全身微笑，有时候是用尽全部精力微笑。

source: A real smile cannot be faked.
zh_cn: 真正的微笑不会是虚假的。

source: When you run around emanating a radiant glow in response to all the joys of life, you are bound to attract some admirers.
zh_cn: 当你因为生活的美好周围散发出光芒时，你肯定会吸引更多人的羡慕之情。

source: They Are Well Adjusted
zh_cn: 他们是很好的评判家

source: Happy people revel in life's small pleasures.
zh_cn: 快乐的人满足于生活中取得的小幸福。

source: This gives them access to sources of joy that pass most people by.
zh_cn: 这种知足感使他们获得了大多数人都会忽视的幸福的源泉。

source: At the same time, they don't get bogged down by the petty little details that seem to keep plenty of others stuck in the dumps.
zh_cn: 同时，他们不会对小细节斤斤计较，大多数人都会被这些小细节所牵绊。

source: They know what is worth savoring and what to disregard.
zh_cn: 快乐的人知道轻重，知道哪些应该重视，哪些应该放弃。

source: Happy people have a rational sense of scale to keep them grounded.
zh_cn: 快乐的人很理性，这种理性使他们很接地气。

source: The resulting positive perspective can turn any problem into an opportunity for growth.
zh_cn: 积极的心态会把任何困难都变成使人成长的机会。

source: They Surround Themselves with Happy People
zh_cn: 他们会与快乐的人妥协

source: Whether they actively seek out other folks with similar habits or they have the effect of raising the positive charge everywhere they go, happy people do not often stand alone.
zh_cn: 不管快乐的人是否积极寻找与他们有相同习惯的人还是他们的快乐影响他们所到之处的人，他们一般都不会是一个人。

source: Glee is contagious.
zh_cn: 快乐会传染。

source: Groups of people tend to observe each other and subsequently imitate the most attractive behaviors they find in those around them.
zh_cn: 成群结队的人很容易观察其他人，并且会不自觉的模仿他们周围最有魅力的人的行为习惯。

source: If enough folks agree to treat each other the way they would like to be treated, the result will be infectious and irresistible to bystanders.
zh_cn: 如果大家对待他人像别人对待自己一样，那么结果对于旁观者来说是极具感染性和诱惑力的。

source: They Are Spontaneous
zh_cn: 他们自然

source: A good relationship with the value of each passing moment is an essential component of happiness.
zh_cn: 与有价值的人维持一段好的人际关系是快乐的重要组成部分。

source: If living in the present is so easy to do, why is it so many people are preoccupied with thoughts of the elsewhere, the future, and the past?
zh_cn: 如果说活在当下是一件不容易的事情，那么为什么那么多的人想着其他事情呢？之前发生的以及畅想未来发生的？

source: Happy people are comfortable in their skin. They are content and aware in whatever moment they inhabit.
zh_cn: 快乐的人欣赏自己，活在当下。

source: This allows them to see opportunities for fun and adventure which others might overlook.
zh_cn: 这种心态使他们很容易抓住机会快乐和冒险，而这些快乐和冒险是其他人会忽视掉的。

source: It is part of why happy people are always the life of the party.
zh_cn: 这就是快乐的人总是派对上一员的原因。

source: They Are Good Listeners
zh_cn: 他们是很好的倾听者

source: Communication is about more than just barking a bunch of orders and wondering why nobody is listening.
zh_cn: 交流不仅仅只是一大堆订单，以及思考为什么没有人倾听。

source: Harmony cannot exist in a vacuum.
zh_cn: 和谐在真空中是不存在的。

source: Can you imagine trying to sing in a barbershop quartet without being able to hear the other singers?
zh_cn: 试想下，当你试着在一个发廊里唱歌，在这个发廊里你不用听其他人歌唱的场景？

source: In order to create a resonating chord, you must listen to what is happening around you and find just the right place for your own vibrations.
zh_cn: 为了能奏出产生共鸣的和弦，你必须倾听周围其他人，以及找到合适的位置来展现自己的旋律。

source: Happy people are always looking for new perspectives as a way of informing their own.
zh_cn: 快乐的人总是寻找新的视角，这种新视角使得他们出类拔萃。

source: The feelings of others matter deeply to them because they know the greater good involves far more than just their own desires.
zh_cn: 他们非常在乎周围人的感受因为他们知道大家好才是真的好。

source: Happy people have made a lifelong commitment to constantly learning, and they know the only way to do this is to be quiet and listen.
zh_cn: 快乐的人把持续不断的学习作为一生的使命，因为他们知道唯一需要做的事情就是保持安静以及倾听。

source: They Expect Less
zh_cn: 他们容易满足

source: It stands to reason that if you expect less, you will be satisfied with less.
zh_cn: 如果你希望的越少，你就会越满足。这句话说的有道理。

source: This mindset allows a more sustainable and unmaterialistic approach to life.
zh_cn: 这种心态早就了可持续发展的，非物质的人生。

source: Those who focus on what others should be doing for them are often disappointed more often than they are satisfied.
zh_cn: 一门心思想着别人应该为自己做什么的人往往相对于满足得到更多的是失望。

source: True happiness comes from within, not from deeds or objects originating outside the self.
zh_cn: 真正的快乐来源于自身，而不是外在的行为或者物件。

source: Happy people know this, and they expect more from themselves than they do from external sources.
zh_cn: 快乐的人明白这个道理，所以他们对别人要求少，对自己要求多。

source: They are more likely to accept than to demand, simply because a state of acceptance is a much healthier place to be than one of constant unmet demands.
zh_cn: 比起需求，他们更倾向于接受，因为比起持续不断的需求，接受是更健康的心态。

source: They Don't Judge
zh_cn: 他们不会评头论足

source: Nobody likes being judged.
zh_cn: 没有人喜欢被别人评头论足。

source: This is because the majority of judgments we make about each other are false and misinformed.
zh_cn: 因为我们对别人做的大多数评价都是错误的，误导人的。

source: Happy people understand through their own experiences that life is a perpetual learning process and everything we go through changes us in some way.
zh_cn: 快乐的人通过自己的生活经历深刻理解，生活其实是一个不断学习的过程，生活中经历的任何事情在某种程度上都改变了我们。

source: With this knowledge, it just doesn't make sense to hold a bunch of grudges.
zh_cn: 有了这种认知，人们心中就不太会有怨恨。

source: Happy people accept that we all struggle with different weaknesses, and everyone has the potential to figure things out in due time.
zh_cn: 快乐的人接受我们所有人都有弱点，并与之搏斗，人们在某种困境中能够激发自己的潜能。

source: This makes happy people better and more patient companions than those who are always judging others for their weaknesses.
zh_cn: 这使得快乐的人变的更好，使他们比起那些总是评头论足他人的人成为更有耐心的伴侣。

source: The road to happiness is not an easy one to travel.
zh_cn: 通往快乐的道路不是一趟简单的旅程。

source: It requires a sense of humble honesty which does not come naturally to everyone.
zh_cn: 这趟旅行需要真诚，并不是每个人生来便具有这种真诚。

source: Happy people are popular and successful for a reason.
zh_cn: 快乐的人受人欢迎以及能够取得成功都是有原因的。

source: Anyone who smiles that much has got to be doing something right.
zh_cn: 经常微笑的人就已经做得很好了。

source: It's time you realized how much you have to learn from them.
zh_cn: 现在你应该意识到你能从快乐的人学到很多。

source: Happy people do not want you to be jealous.
zh_cn: 快乐的人不希望你嫉妒他人。

source: They want you to share in their joy by opening yourself up to the lessons all around you.
zh_cn: 他们希望你通过打开自己的心扉，从他人身上学习来分享他们的喜悦。

source: They want to learn from you while inspiring you with their example.
zh_cn: 他们想要向你学习，同时你也能从他们的身上受到鼓舞。

source: This is why we love happy people, and the world would probably stop turning without them.
zh_cn: 这就是我们喜欢快乐的人的原因。没有快乐的人，这个世界将会停止运转。

source: Hug your local happy person today.
zh_cn: 今天尽情去拥抱你周围快乐的人。

source: Let them take you by the hand and lead you toward a better life.
zh_cn: 让他们手把手带领你通往幸福美满的生活。
